Documents/ПриёмЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПриёмЗаявок</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяДлительность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПриёмЗаявок/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьДанныеКлиента(телефон)
	
	НайденныйКлиент = Справочники.Клиенты.НайтиПоРеквизиту("НомерТелефона", телефон);
	
	КлСтрукт = Новый Структура("ФИО, Адрес, Почта", НайденныйКлиент.Наименование, НайденныйКлиент.Адрес, НайденныйКлиент.Почта);  
	
	Возврат КлСтрукт;
	
КонецФункции  


&НаСервере
Функция КлиентСуществует(номер)
	
	Если Справочники.Клиенты.НайтиПоРеквизиту("НомерТелефона",номер).НомерТелефона = номер тогда   
		
		Возврат Истина;   
		
	Иначе              
		
		Возврат Ложь;  
		
	КонецЕсли;	     
	
КонецФункции    


&НаСервере
Функция УслугиПриИзмененииНаСервере(услуга)  

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цены.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены КАК Цены
	|ГДЕ
	|	Цены.Услуга = &Ссылка";   
	
	Запрос.УстановитьПараметр("Ссылка",услуга); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		Цена = Выборка.Цена;
	КонецЦикла; 
	
	Возврат Цена;  
	
КонецФункции       


&НаСервере
Функция ДлительностьУслуги(услуга)
	Длительность = Справочники.Услуги.НайтиПоНаименованию(услуга).Длительность;
	Возврат Длительность; 
	
КонецФункции


&НаСервере
Функция ПоследняяЗаявкаБригады(Бригада)
	
	Запрос = Новый Запрос;
		Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПриёмЗаявок.ДатаВыполнения, 
	|	ПриёмЗаявок.ОбщаяДлительность
	|ИЗ
	|	Документ.ПриёмЗаявок КАК ПриёмЗаявок
	|ГДЕ
	|	ПриёмЗаявок.Бригада = &Бригада
	|УПОРЯДОЧИТЬ ПО
	|	ПриёмЗаявок.Дата УБЫВ";
	Запрос.УстановитьПараметр("Бригада", Бригада);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		Док = Новый Структура("ДатаВыполнения, ОбщаяДлительность", Выборка.ДатаВыполнения, Выборка.ОбщаяДлительность);
		
		Возврат Док;

	КонецЦикла; 

КонецФункции


&НаКлиенте
Процедура Заполнить(Команда)     
	
	Если Элементы.ЗаполнитьДанные.Доступность = Истина тогда
		
		ТЗ = ПолучитьДанныеКлиента(Объект.ТелефонКлиента);
		
		Объект.Клиент = ТЗ.ФИО;
		Объект.Адрес = ТЗ.Адрес;
		Объект.Почта = ТЗ.Почта;
		
	Иначе      
		
		Объект.Клиент = ""; 
		Объект.Адрес = "";
		Объект.Почта = "";
		                                                                             
		Предупреждение("Клиент не зарегистрирован, данные для заполнения отсутствуют");
		
	КонецЕсли;   
	
КонецПроцедуры   


&НаКлиенте
Процедура ТелефонКлиентаПриИзменении(Элемент)
		
	Если КлиентСуществует(Объект.ТелефонКлиента) тогда  
		
		Элементы.ЗаполнитьДанные.Доступность = Истина;
		Элементы.ТелефонКлиента.ЦветТекста = WebЦвета.Зеленый;  
		
	Иначе 
		
		Элементы.ЗаполнитьДанные.Доступность = Ложь;		
		Элементы.ТелефонКлиента.ЦветТекста = Новый Цвет(51,51,51);  
		
	КонецЕсли;   
	
КонецПроцедуры


&НаКлиенте
Процедура УслугиПриИзменении(Элемент)          
	
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;     
	
	СтрокаТабличнойЧасти.Цена = УслугиПриИзмененииНаСервере(СтрокаТабличнойЧасти.Услуги); 
	
	СтрокаТабличнойЧасти.Длительность = ДлительностьУслуги(СтрокаТабличнойЧасти.Услуги); 
	
	Объект.ОбщаяДлительность = Дата(1,1,1) + 1200;
	
	Для каждого СтрокаДокумента Из Объект.Услуги Цикл
		
		Объект.ОбщаяДлительность = Объект.ОбщаяДлительность + (СтрокаДокумента.Длительность - Дата(1,1,1));
		
	КонецЦикла;
	
	ПроверкаВремениРаботы();
	
КонецПроцедуры
	
	
&НаКлиенте
Процедура ПроверкаВремениРаботы()
	
	Попытка 
		
		ПустаяДата = Дата(1,1,1);		
		СтрукПЗ = ПоследняяЗаявкаБригады(Объект.Бригада);
		
		КонецПЗ = ПустаяДата + (СтрукПЗ.ДатаВыполнения - ПустаяДата) + (СтрукПЗ.ОбщаяДлительность - ПустаяДата);
		
		Если (КонецПЗ > Объект.ДатаВыполнения) ИЛИ (Час(Объект.ОбщаяДлительность) >= 12) тогда
			
			Объект.ДоступностьВыполнения = Ложь;
			
		Иначе
			
			Объект.ДоступностьВыполнения = Истина;

  		КонецЕсли;
		
			
	Исключение   
		
	КонецПопытки; 
	
	Если Час(Объект.ОбщаяДлительность) > 9 тогда
		
		Элементы.ЗаявкаВыполнена.Доступность = Ложь;
		Объект.ДоступностьВыполнения = Ложь;
		Элементы.ДоступностьВыполнения.Подсказка = "Время выполнения поставленных задач превышает время рабочего дня.";
		
	ИначеЕсли ((Час(Объект.ДатаВыполнения) + Час(Объект.ОбщаяДлительность)) >= 18) ИЛИ ((Час(Объект.ДатаВыполнения) + Час(Объект.ОбщаяДлительность)) <= 9) тогда
		
		Элементы.ЗаявкаВыполнена.Доступность = Ложь;
		Объект.ДоступностьВыполнения = Ложь;
		Элементы.ДоступностьВыполнения.Подсказка = "Время выполнения поставленных задач превышает время рабочего дня.";
		
	ИначеЕсли (Час(Объект.ДатаВыполнения) < 9) ИЛИ (Час(Объект.ДатаВыполнения) > 18) тогда
		
		Элементы.ЗаявкаВыполнена.Доступность = Ложь;
		Объект.ДоступностьВыполнения = Ложь;
		Элементы.ДоступностьВыполнения.Подсказка = "Время выполнения поставленных задач превышает время рабочего дня.";
		
	ИначеЕсли Объект.Бригада <> "" тогда
		
		Элементы.ЗаявкаВыполнена.Доступность = Истина;
		Объект.ДоступностьВыполнения = Истина;
		Элементы.ДоступностьВыполнения.Подсказка = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ДоступностьВыполнения <> Истина тогда
		
		Отказ = Истина;
		
	ИначеЕсли ((Объект.Клиент = "") ИЛИ (Объект.Адрес = "")) ИЛИ (СтрДлина(Объект.ТелефонКлиента) < 17) тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
